<?php

namespace Database\Factories;

use App\Models\FilamentBlog\Post;
use Illuminate\Database\Eloquent\Factories\Factory;
use Stephenjude\FilamentBlog\Models\Author;
use Stephenjude\FilamentBlog\Models\Category;
use Str;

class PostFactory extends Factory
{
    protected $model = Post::class;
    /**
     * Define the model's default state.
     *
     * @return array
     */
    public function definition()
    {
        return [
            'blog_author_id' => Author::all()->random()->id,
            'blog_category_id' => Category::all()->random()->id,
            'title' => $this->faker->sentence(20),
            'slug' => "5abara-masry-" . Str::random(10),
            'excerpt' => "تحويل معهد ناصر إلى مدينة طبية متكاملة نقلة صحية لمحدودى الدخل",
            'banner' => 'blog/image.jpg',
            'content' => "<div>أكدت دراسة حديثة صادرة عن المرصد المصرى التابع للمركز المصرى للفكر والدراسات الاستراتيجية، أن تحويل معهد ناصر إلى مدينة طبية يعكس إصرار الدولة المصرية على الارتقاء بالمنظومة الصحية لمحدودي الدخل للحصول على رعاية متكافئة، رغم كل التحديات الاقتصادية الراهنة، مضيفة أنه يعد خطوة مهمة في طريق الإصلاح الصحي للمستشفيات والمعاهد التابعة لوزارة الصحة.</div><div>&nbsp;</div><div>وأضافت الدراسة أنه يمكن القول أن يكون خطوة في النظر إلى وضع خطوة تطوير كاملة لباقي المعاهد في مختلف المحافظات، مما يسهم في تعزيز دور مصر في السياحة العلاجية، خاصة وأن معهد ناصر هو مقصد للعديد من مواطني الدول العربية؛ نظرًا إلى وجود كفاءات طبية مميزة به، مما يجعل مصر واجهة علاجية عالمية.</div><div>&nbsp;</div><div>ولفتت الدراسة الى أن الرئيس عبد الفتاح السيسي وجه بتطوير معهد ناصر للعلاج، ليصبح مدينة طبية متكاملة، من خلال زيادة الطاقة الاستيعابية له، ورفع كفاءة البنية التحتية، ويهدف التطوير إلى استيعاب الزيادة المتوقعة من المرضى نتيجة زيادة عدد السكان، وزيادة الطاقة الاستيعابية الحالية لإنهاء قوائم الانتظار، علاوة على رفع كفاءة البنية التحتية لمواكبة التطور الطبي، وتحقيق الاستدامة في الخدمات الطبية المقدمة، حيث يبلغ معدل التردد على معهد ناصر في العام 2 مليون زيارة.</div><div>&nbsp;</div><div>وأشارت الدراسة الى أن هذه الخطوة تعد نقلة نوعية في منظومة الخدمات الصحية المقدمة للمواطن، وتعزيز مفهوم حقوق الإنسان من خلال رفع مستوى خدمات الرعاية الصحية في المستشفيات لتقديم خدمة صحية لائقة للمواطنين، وكذلك استخدام أعلى معايير في التكنولوجيا العالمية؛ لتحقيق أعلى استفادة للمرضى، سواء في التشخيص أو الطرق الدوائية.</div><div>&nbsp;</div> <br> ",
            "published_at" => now(),
        ];
    }
}
